guohanqing/stm32f407VG/components/Stemwin/emWinTask/MainTask.c
/*
*********************************************************************************************************
*	                                  
*	模块名称 : 洗衣机简易操作界面
*	文件名称 : MainTask.c
*	版    本 : V3.0
*	说    明 : 实验内容如下
*              1. 本实例有三个值得大家学习的地方:
*                 （1）自定义按钮的实现，主要是通过自定义按钮的回调函数实现按钮的不同显示效果。
*                 （2）自定义菜单的实现，显示效果更好。
*                 （3）内存设备相关函数GUI_MEMDEV_Create，GUI_MEMDEV_Select，GUI_MEMDEV_Write的使用。
*                      通过函数数GUI_MEMDEV_Create申请所需的内存设备，然后通过函数GUI_MEMDEV_Select
*                      选择要使用的函数，这样绘图操作实现的界面就可以直接写到内存设备中，需要显示的时候
*                      直接调用函数GUI_MEMDEV_Write就能进行显示。
*              2. 本设计界面支持按键操作：
*                 （1）按键K3实现ESCAPE功能，也就是退出显示界面，在本工程中主要是关闭子菜单。
*                 （2）摇杆的上下左右键实现菜单选项的选项和子菜单的显示，按下摇杆的下键就能显示子菜单
*                 （3）摇杆的OK可以触发洗衣机界面中的start启动按钮。
*
*	修改记录 :
*		版本号    日期          作者        说明
*		V1.0    2014-06-03    Eric2013      首发
*	    V2.0    2015-04-15    Eric2013      1. 升级固件库到V1.5.0
*                                           2. 升级BSP板级支持包 
*                                           3. 升级fatfs到0.11
*                                           4. 升级STemWin到5.26
*                                           5. 更改为新的四点触摸校准算法，并重查编排触摸检测任务
*                                           6. 添加7寸800*480分辨率电容屏支持，添加3.5寸480*320的ILI9488支持。
*                                           7. 重新编排uCOS-III的任务。
*	    V3.0    2015-12-18  Eric2013        1. 升级BSP板级支持包 
*                                           2. 升级STemWin到5.28
*                                           3. 添加4.3寸和5寸电容屏支持。
*	
*	Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
//#include "includes.h"
#include "MainTask.h"
#include <math.h>
#include "stm32f4xx.h"
extern uint8_t flag_gui_timer;
/*
*********************************************************************************************************
*                                       引用外部定义
*********************************************************************************************************
*/ 
extern GUI_CONST_STORAGE GUI_FONT GUI_FontYahei;
extern GUI_CONST_STORAGE GUI_BITMAP bmLogo_armfly;
extern GUI_CONST_STORAGE GUI_FONT GUI_Font18B;
extern GUI_CONST_STORAGE GUI_FONT GUI_Font60BD;
extern GUI_CONST_STORAGE GUI_FONT GUI_Font18;
extern GUI_CONST_STORAGE GUI_FONT GUI_Font60min;
extern GUI_CONST_STORAGE GUI_BITMAP _bmSubTop;
extern GUI_CONST_STORAGE GUI_BITMAP _bmSubBottom;
extern GUI_CONST_STORAGE GUI_BITMAP _bmBlueCircle;  
extern GUI_CONST_STORAGE GUI_BITMAP _bmCheckMark;

/*
*********************************************************************************************************
*                                       类型定义
*********************************************************************************************************
*/ 
typedef struct {
  int           NumItems;
  const char ** pData;
} SUB_ITEMS;

typedef struct {
  int Delay;
  int Cmd;
  int Param;
} ACTION_ITEM;

typedef struct {
  int State;
} EXEC_MACHINE_CONTEXT;

/*
*********************************************************************************************************
*                                       宏定义
*********************************************************************************************************
*/ 
#define STATUS_CHECK_CHECKED 1
#define STATUS_CHECK_DRAWONE 2
#define STATUS_CHECK_DRAWTWO 3
#define MENU_Y0              41
#define MENU_Y1              75
#define SUB_X0               4
#define SUB_Y0               14
#define SUB_X1               65
#define SUB_YD               25
#define CMD_KEY              1
#define CMD_EXEC             2
#define EXEC_START           1
#define EXEC_WAIT            2
#define STATE_READY          1
#define STATE_DELAY          2
#define STATE_WASHING        3
#define INIT_BUTTON          (WM_USER + 0)
#define MAIN_OPEN_SUB        (WM_USER + 1)
#define MAIN_CLOSE_SUB       (WM_USER + 2)

/*
*********************************************************************************************************
*                                       文本
*********************************************************************************************************
*/ 
static const char * _pText[] = {
  "Pre", 
  "Wash", 
  "Rinse", 
  "Spin",
  "Soil" 
};

static const char * _pTextPre[] = {
  "Off",
  "On"
};

static const char * _pTextWash[] = {
  "Warm",
  "Cold"
};

static const char * _pTextRinse[] = {
  "Warm",
  "Cold"
};

static const char * _pTextSpin[] = {
  "High",
  "Low"
};

static const char * _pTextSoil[] = {
  "Heavy",
  "Normal",
  "Light"
};

/*
*********************************************************************************************************
*                             洗衣机的几个工作状态的显示位置
*********************************************************************************************************
*/ 
static int _aStatusSep[5] = {3, 30, 130, 184, 217};

/*
*********************************************************************************************************
*                                       静态变量
*********************************************************************************************************
*/ 
static const int _aSeparator[] = { 20, 55, 110, 170, 220, 280 };
static const int _axPos[]      = { 20, 58, 118, 180, 235      };
static const int _aSubPosX[]   = {  5, 55, 115, 165, 225      };
static SUB_ITEMS _SubItems;
static unsigned  _Selection    = 2;
static WM_HWIN   _hStatus;
static int       _aSelection[] = { 1, 0, 1, 1, 0 };
static int       _Time;
static int       _State;
static int       _NoMemory;

/*
*********************************************************************************************************
*	函 数 名: _DrawGradientRoundBar
*	功能说明:  Draws a vertical gradient in form of a rounded bar
*	形    参：xPos0     起始位置X
*             yPos0     起始位置Y
*             xPos1     结束位置X
*             yPos1     结束位置Y
*             Color0    梯度起始色
*             Color1    梯度结束色
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DrawGradientRoundBar(int xPos0, int yPos0, int xPos1, int yPos1, GUI_COLOR Color0, GUI_COLOR Color1) 
{
	GUI_COLOR Color;
	unsigned  r;
	unsigned  g;
	U32       b;
	double    rd;
	double    rr;
	double    x;
	double    y;
	int       Add;
	int       r0;
	int       g0;
	int       b0;
	int       r1;
	int       g1;
	int       b1;
	int       d;
	int       i;

