guohanqing/stm32f407VG/components/Stemwin/emWinTask/MainTask.c
	r0  = (Color0 >>  0) & 0x000000ff;
	g0  = (Color0 >>  8) & 0x000000ff;
	b0  = (Color0 >> 16) & 0x000000ff;
	r1  = (Color1 >>  0) & 0x000000ff;
	g1  = (Color1 >>  8) & 0x000000ff;
	b1  = (Color1 >> 16) & 0x000000ff;
	Add = -1;
	d   = yPos1 - yPos0 + 1;
	rd  = (yPos1 - yPos0) / 2.0;
	rr  = rd * rd;
	y   = rd;
	
	for (i = yPos0; i <= yPos1; i++) 
	{
		x = sqrt(rr - y * y);
		r = r0 + (r1 - r0) * (i - yPos0) / d;
		g = g0 + (g1 - g0) * (i - yPos0) / d;
		b = b0 + (b1 - b0) * (i - yPos0) / d;
		Color = r | (g << 8) | (b << 16);
		GUI_SetColor(Color);
		
		GUI_DrawHLine(i, (int)(xPos0 + rd - x), (int)(xPos0 + rd));
		GUI_DrawHLine(i, (int)(xPos0 + rd),     (int)(xPos1 - rd));
		GUI_DrawHLine(i, (int)(xPos1 - rd),     (int)(xPos1 - rd + x));
		
		y += Add;
		if (y < 0) 
		{
			Add = -Add;
			y = -y;
		}
	}
}

/*
*********************************************************************************************************
*	函 数 名: _DrawCheckbox
*	功能说明: 绘制自定义checkbox
*	形    参：x       起始位置X
*             y       起始位置Y
*             Status  状态
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DrawCheckbox(int x, int y, int Status) 
{
	GUI_COLOR ColorOld;
	U16       c;

	c = 0;
	ColorOld = GUI_GetColor();
	
	/* 绘制蓝色圆圈位图 */
	GUI_DrawBitmap(&_bmBlueCircle, x, y);
	
	switch (Status) 
	{
		/* 自定义checkb支持以下三种自定义状态 */
		case STATUS_CHECK_CHECKED:
			GUI_DrawBitmap(&_bmCheckMark, x + 4, y - 2);
			break;
		
		case STATUS_CHECK_DRAWONE:
			c = '1';
		
		//lint -fallthrough
		case STATUS_CHECK_DRAWTWO:
			if (c == 0) 
			{
				c = '2';
			}
			GUI_SetColor(0xEBAD00);
			GUI_SetFont(&GUI_Font18B);
			GUI_SetTextMode(GUI_TM_TRANS);
			GUI_DispCharAt(c, x + 5, y + 1);
			break;
	}
	
	GUI_SetColor(ColorOld);
}

/*
*********************************************************************************************************
*	函 数 名: _OnKeySub
*	功能说明: 子菜单回调函数的重绘函数
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void _OnPaintSub(WM_HWIN hWin) 
{
	int ySize;
	int i;

	ySize = WM_GetWindowSizeY(hWin);
	/* 绘制菜单控件的顶端部分 */
	GUI_DrawBitmap(&_bmSubTop,    0, 0);
	/* 绘制菜单控件的底端部分 */
	GUI_DrawBitmap(&_bmSubBottom, 0, ySize - _bmSubBottom.YSize - 1);
	/* 绘制菜单控件的中间部分 */
	GUI_SetColor(0xff0000);
	GUI_FillRect(0, _bmSubTop.YSize, 69, ySize - _bmSubBottom.YSize);
	
	/* 绘制菜单上要显示的文本 */
	GUI_SetTextMode(GUI_TM_TRANS);
	GUI_SetFont(&GUI_Font18B);
	
	/* 遍历菜单的所有项进行显示 */
	for (i = 0; i < _SubItems.NumItems; i++) 
	{
		/* 选中的话白底蓝字 */
		if (_aSelection[_Selection] == i) 
		{
			GUI_SetColor(GUI_WHITE);
			GUI_FillRect(SUB_X0, SUB_Y0 + i * SUB_YD, SUB_X1, SUB_Y0 + i * SUB_YD + 19);
			GUI_SetColor(0xff0000);
		}
		/* 没有选中的话蓝底白字 */
		else 
		{
			GUI_SetColor(GUI_WHITE);
		}
		
		GUI_DispStringHCenterAt(_SubItems.pData[i], 35, SUB_Y0 + 1 + i * SUB_YD);
	}
}

/*
*********************************************************************************************************
*	函 数 名: _OnKeySub
*	功能说明: 子菜单的按键消息处理
*	形    参：hWin   指针句柄
*             Key    按键值
*	返 回 值: 无
*********************************************************************************************************
*/
static int _OnKeySub(WM_HWIN hWin, int Key) 
{
	WM_HWIN hParent;

	hParent = WM_GetParent(hWin);
	switch (Key) 
	{
		/* 按下向下的按键，调整选择的子菜单选项下移 */
		case GUI_KEY_DOWN:
			if (_aSelection[_Selection] < (_SubItems.NumItems - 1)) 
			{
				_aSelection[_Selection]++;
				WM_InvalidateWindow(hWin);
				WM_InvalidateWindow(hParent);
			}
			break;
		
		/* 按下向上的按键，调整选择的子菜单选项上移 */
		case GUI_KEY_UP:
			if (_aSelection[_Selection] > 0) 
			{
				_aSelection[_Selection]--;
				WM_InvalidateWindow(hWin);
				WM_InvalidateWindow(hParent);
			}
			break;
		
		/* 收到GUI_KEY_ESCAPE消息，重新聚焦到父窗口并关闭打开的子窗口 */
		case GUI_KEY_ESCAPE:
			WM_SetFocus(hParent);
			WM_SendMessageNoPara(hParent, MAIN_CLOSE_SUB);
			return 0;
		
		/* 收到下面的两种消息，重新聚焦到父窗口并关闭打开的子窗口 */
		case GUI_KEY_LEFT:
		case GUI_KEY_RIGHT:
			WM_SetFocus(hParent);
			WM_SendMessageNoPara(hParent, MAIN_CLOSE_SUB);
			return 1;
		
	}
	
	return 0;
}

/*
*********************************************************************************************************
*	函 数 名: _OnPIDStateChangeSub
*	功能说明: 子菜单的PID事件处理
*	形    参：hWin   指针句柄
*             pInfo  WM_PID_STATE_CHANGED_INFO类型指针
*	返 回 值: 无
*********************************************************************************************************
*/
static void _OnPIDStateChangeSub(WM_HWIN hWin, const WM_PID_STATE_CHANGED_INFO * pInfo) 
{
	WM_HWIN hParent;

	/* 如果不在点击的范围内，退出 */
	if ((pInfo->State == 0) || (pInfo->y < SUB_Y0) || (pInfo->y > (SUB_Y0 + SUB_YD * _SubItems.NumItems))) 
	{
		return;
	}
	if ((pInfo->x < SUB_X0) || (pInfo->x > SUB_X1)) 
	{
		return;
	}
	
	/* 记录当前选择的子菜单 */
	_aSelection[_Selection] = (pInfo->y - SUB_Y0) / SUB_YD;
	
	/* 获取父窗口 */
	hParent = WM_GetParent(hWin);
	WM_InvalidateWindow(hParent);
	
	/* 设置聚焦 */
	WM_SetFocus(hParent);
	/* 删除此子菜单 */
	WM_DeleteWindow(hWin);
}

/*
*********************************************************************************************************
*	函 数 名: _cbSubMenu
*	功能说明: 窗口hSub的回调函数
*	形    参：pMsg  指针地址
*	返 回 值: 无
*********************************************************************************************************
*/
static void _cbSubMenu(WM_MESSAGE * pMsg) 
{
  WM_HWIN hWin;

	hWin = pMsg->hWin;
	switch (pMsg->MsgId) 
	{
		/* PID状态发生变化消息处理 */
		case WM_PID_STATE_CHANGED:
			_OnPIDStateChangeSub(pMsg->hWin, (const WM_PID_STATE_CHANGED_INFO *)pMsg->Data.p);
			return;
		
		/* 按键消息处理 */
		case WM_KEY:
			if (((const WM_KEY_INFO*)(pMsg->Data.p))->PressedCnt > 0) 
			{
				WM_HWIN hParent;
				int Key = ((const WM_KEY_INFO*)(pMsg->Data.p))->Key;
				hParent = WM_GetParent(hWin);
				if (_OnKeySub(hWin, Key)) 
				{
					WM_SendMessage(hParent, pMsg);
				};
			}
			return;
		
		/* 子菜单的重绘函数 */
		case WM_PAINT:
			_OnPaintSub(pMsg->hWin);
			break;
	}
	
	WM_DefaultProc(pMsg);
}

/*
*********************************************************************************************************
*       _ToggleSubMenu
*
* Function description
*   Opens or closes a vertical sub menu.
*
* Parameters
*   - hParent Handle to the parent window.
*   - OnOff   1, if the sub menu has to be opened.
*             0, if the sub menu has to be closed.
*
* Notes
*   This function may be called from _cbMain only as a reaction to the
*   messages MAIN_OPEN_SUB and MAIN_CLOSE_SUB. If the sub menu should
*   be opened or closed one of those messages has to be sent to the
*   main window.
*********************************************************************************************************
*/
static void _ToggleSubMenu(WM_HWIN hParent, U8 OnOff) 
{
	static WM_HWIN hSub = 0;
	
	/* 如果创建了，将其删除 */
	if (hSub) 
	{
		WM_DeleteWindow(hSub);
		hSub = 0;
	}
	
