guohanqing/stm32f407VG/components/Stemwin/emWinTask/MainTask.c
	/* 如果是关闭子菜单，推出即可，因为前面已经将其删除了 */
	if (OnOff == 0) 
	{
		return;
	}
	
	/* 根据选择的_Selection，设置要显示的子菜单内容 */
	switch (_Selection) 
	{
		case 0:
			_SubItems.pData    = _pTextPre;
			_SubItems.NumItems = GUI_COUNTOF(_pTextPre);
			break;
		case 1:
			_SubItems.pData    = _pTextWash;
			_SubItems.NumItems = GUI_COUNTOF(_pTextWash);
			break;
		case 2:
			_SubItems.pData    = _pTextRinse;
			_SubItems.NumItems = GUI_COUNTOF(_pTextRinse);
			break;
		case 3:
			_SubItems.pData    = _pTextSpin;
			_SubItems.NumItems = GUI_COUNTOF(_pTextSpin);
			break;
		case 4:
			_SubItems.pData    = _pTextSoil;
			_SubItems.NumItems = GUI_COUNTOF(_pTextSoil);
			break;
	}
	
	/* 创建子菜单窗口 */
	hSub = WM_CreateWindowAsChild(_aSubPosX[_Selection], 80, 70, _SubItems.NumItems * 25 + 20, hParent, WM_CF_SHOW | WM_CF_HASTRANS, _cbSubMenu, 0);
	/* 设置聚焦 */
	WM_SetFocus(hSub);
}

/*
*********************************************************************************************************
*	函 数 名: _CreateBitmap
*	功能说明: Creates the background image in form of a rounded horizontal bar
*             with a surrounding frame and a gray gradient within the bar
*	形    参：hWin    窗口句柄
*             xPos0   起始X位置  
*			  yPos0   起始Y位置
*             xPos1   结束X位置
*             yPos1   结束Y位置
*	返 回 值: 无
*********************************************************************************************************
*/
static GUI_MEMDEV_Handle _CreateBitmap(WM_HWIN hWin, int xPos0, int yPos0, int xPos1, int yPos1) 
{
	GUI_MEMDEV_Handle hMem;
	GUI_MEMDEV_Handle hOld;
	int               xPos;
	int               yPos;
	int               r;

	r    = (yPos1 - yPos0 + 1) / 2;
	xPos = WM_GetWindowOrgX(hWin);                /* 分别返回指定窗口的原点在桌面坐标中的X或Y位置 */
	yPos = WM_GetWindowOrgY(hWin);
	
	/* 注意这里是相对于桌面窗口的位置 */
	hMem = GUI_MEMDEV_Create(xPos + xPos0,        /* 存储设备的X位置。*/
	                         yPos + yPos0,        /* 存储设备的Y位置。*/
	                         xPos1 - xPos0 + 1,   /* 存储设备的X尺寸。*/
	                         yPos1 - yPos0 + 1);  /* 存储设备的Y尺寸。*/
	
	if (hMem) 
	{
		WM_SelectWindow(hWin);
		hOld = GUI_MEMDEV_Select(hMem);
		GUI_DrawGradientV(5, 40, 314, 76, 0xffffff, 0xffebeb);
		_DrawGradientRoundBar(xPos0 + 2, yPos0 + 2, xPos1 - 2, yPos1 - 2, 0xEEEEEE, 0x737373);
		GUI_SetColor(0xff0000);
		GUI_SetPenSize(3);
		GUI_AA_DrawArc(xPos0 + r, yPos0 + r, r - 2, r - 2,  90, 270);
		GUI_AA_DrawArc(xPos1 - r, yPos0 + r, r - 2, r - 2, 270, 450);
		GUI_AA_DrawLine(xPos0 + r, yPos0 + 2, xPos1 - r, yPos0 + 2);
		GUI_AA_DrawLine(xPos0 + r, yPos1 - 2, xPos1 - r, yPos1 - 2);
		GUI_MEMDEV_Select(hOld);
	} 
	else 
	{
		_NoMemory = 1;
	}
	
	return hMem;
}

/*
*********************************************************************************************************
*	函 数 名: _OnKeyMain
*	功能说明: 窗口hWinMain回调函数的重绘函数  
*	形    参：hWin        窗口句柄
*             phBitmap    GUI_MEMDEV_Handle类型指针
*	返 回 值: 无
*********************************************************************************************************
*/
static void _OnPaintMain(WM_HWIN hWin, GUI_MEMDEV_Handle * phBitmap) 
{
	static int xSize;
	unsigned   i;
	
	/* 获取窗口长度 */
	if (xSize == 0) 
	{
		xSize = WM_GetWindowSizeX(hWin);
	}
	
	/* 第一步：绘制背景 ***************************************/
	GUI_MEMDEV_Write(*phBitmap);

	/* 第二步：绘制菜单 ***************************************/
	GUI_SetTextMode(GUI_TM_TRANS);
	for (i = 0; i < GUI_COUNTOF(_pText); i++) 
	{
		/* 第一个checkbox选项 */
		if (i == 0) 
		{
			if (_aSelection[0]) 
			{
				GUI_SetFont(&GUI_Font18B);
			} 
			else 
			{
				GUI_SetFont(&GUI_Font18);
			}
		} 
		/* 其余菜单 */
		else 
		{
			GUI_SetFont(&GUI_Font18);
		}
		
		if (_Selection == i) 
		{
			GUI_SetColor(GUI_BLACK);
		} 
		else 
		{
			GUI_SetColor(0x9D9FA1);
		}
		
		GUI_DispStringAt(_pText[i], _axPos[i], 10);
	}
	
	/* 第三步：绘制checkbox ***************************************/
	_DrawCheckbox(19, 48, _aSelection[0]);
	
	/* 第四步：绘制其余菜单选项 ***********************************/
	if (_Selection) 
	{
		GUI_SetColor(0xff0000);
		GUI_FillRect(_aSeparator[_Selection], MENU_Y0, _aSeparator[_Selection + 1], MENU_Y1);
	}
	
	GUI_SetColor(GUI_WHITE);
	GUI_SetFont(&GUI_Font18B);
	GUI_DispStringHCenterAt(_pTextWash [_aSelection[1]], (_aSeparator[1] + _aSeparator[2]) / 2, 48);
	GUI_DispStringHCenterAt(_pTextRinse[_aSelection[2]], (_aSeparator[2] + _aSeparator[3]) / 2, 48);
	GUI_DispStringHCenterAt(_pTextSpin [_aSelection[3]], (_aSeparator[3] + _aSeparator[4]) / 2, 48);
	GUI_DispStringHCenterAt(_pTextSoil [_aSelection[4]], (_aSeparator[4] + _aSeparator[5]) / 2, 48);
	
	/* 分别设置洗衣机运行中和非运行中的显示效果 */
	if (_State == STATE_WASHING) 
	{
		//
		// Show remaining time it is washing
		//
		GUI_SetColor(0xff0000);
		GUI_SetFont(&GUI_Font60BD);
		GUI_DispDecAt(_Time, 115, 140, 2);
		GUI_SetFont(&GUI_Font60min);
		GUI_DispString("min");
	} 
	else 
	{
		//
		// 如果洗衣机不工作的话，显示logo
		//
		GUI_DrawBitmap(&bmLogo_armfly, 90, 90);
	}
}

/*
*********************************************************************************************************
*	函 数 名: _OnKeyMain
*	功能说明: 水平菜单栏的按键消息处理
*	形    参：hWin   窗口句柄
*             Key    按下的按键值
*	返 回 值: 无
*********************************************************************************************************
*/
static void _OnKeyMain(WM_HWIN hWin, int Key) 
{
	/* 如果洗衣机在工作状态，对按键消息不做处理 */
	if (_State == STATE_WASHING) 
	{
		return;
	}
	
	switch (Key) 
	{
		/* 左键消息，调整_Selection，从而实现水平菜单选择项的调整 */
		case GUI_KEY_LEFT:
			if (_Selection) 
			{
				_Selection--;
				WM_InvalidateWindow(hWin);
			}
			break;
		
        /* 右键消息，调整_Selection，从而实现水平菜单选择项的调整 */			
		case GUI_KEY_RIGHT:
			if (_Selection < (GUI_COUNTOF(_pText) - 1)) 
			{
				_Selection++;
				WM_InvalidateWindow(hWin);
			}
			break;
		
		/* 打开子菜单 */
		case GUI_KEY_DOWN:
			WM_SendMessageNoPara(hWin, MAIN_OPEN_SUB);
			break;
	}
}

/*
*********************************************************************************************************
*	函 数 名: _OnPIDStateChangeMain
*	功能说明: 水平菜单栏的PID状态改变后的事件处理
*	形    参：hWin   窗口句柄
*             pInfo  WM_PID_STATE_CHANGED_INFO类型指针
*	返 回 值: 无
*********************************************************************************************************
*/
static void _OnPIDStateChangeMain(WM_HWIN hWin, const WM_PID_STATE_CHANGED_INFO * pInfo) 
{
	unsigned i;
	int      x;

	/* 点击了statrt按钮后，水平菜单栏的PID状态改变将不起作用 */
	if (_State == STATE_WASHING) 
	{
		return;
	}
	
	/* 保证点击在了相应的范围内才起作用 */
	if ((pInfo->State == 0) || (pInfo->y < MENU_Y0) || (pInfo->y > MENU_Y1)) 
	{
		return;
	}
	
