guohanqing/stm32f407VG/components/Stemwin/emWinTask/MainTask.c
	if ((pInfo->x < _aSeparator[0]) || (pInfo->x > _aSeparator[5])) 
	{
		return;
	}
	
	/* 根据点击的具体选项，向窗口发送相应消息 */
	for (i = 0; i < GUI_COUNTOF(_aSeparator) - 1; i++) 
	{
		x = pInfo->x;
		if ((x >= _aSeparator[i]) && (x <= _aSeparator[i + 1])) 
		{
			/* 菜单的某个选项被点击后，发送消息 */
			WM_SendMessageNoPara(hWin, MAIN_CLOSE_SUB);
			_Selection = i;
			WM_InvalidateWindow(hWin);
			
			/* 其余选项被点击 */
			if (i) 
			{
				WM_SendMessageNoPara(hWin, MAIN_OPEN_SUB);
			} 
			/* 第一个选项被点击 */
			else 
			{
				_aSelection[_Selection] ^= 1;
			}
			
			return;
		}
	}
}

/*
*********************************************************************************************************
*	函 数 名: _cbStatus
*	功能说明: 窗_hStatus回调函数  
*	形    参：pMsg  参数指针
*	返 回 值: 无
*********************************************************************************************************
*/
static void _cbStatus(WM_MESSAGE * pMsg) 
{
	static GUI_MEMDEV_Handle   hBitmap;
	static int                 xSize;
	static int                 ySize;
	const GUI_PID_STATE      * pState;
	GUI_MEMDEV_Handle          hOld;
	WM_HWIN                    hWin;
	int                        NewTime;
	int                        xPos;
	int                        yPos;
	int                        i;

	hWin = pMsg->hWin;
	
	switch (pMsg->MsgId) 
	{
		/* 指针输入设备接触到处于按下状态的窗口轮廓时发送到窗口 */
		case WM_TOUCH:
			pState = (const GUI_PID_STATE *)pMsg->Data.p;
			if (pState) 
			{
				if (pState->Pressed) 
				{
					NewTime = 90 - ((pState->x - 3) * 90) / (xSize - 6);
					if (NewTime < 0) 
					{
						NewTime = 0;
					}
					if (NewTime < _Time) 
					{
						_Time = NewTime;
					}
				}
			}
			break;
		
        /* 重绘消息 */			
		case WM_PAINT:
			GUI_MEMDEV_Write(hBitmap);
			xPos = 3 + ((90 - _Time) * (xSize - 6)) / 90;
			GUI_SetAlpha(0xA0);
			GUI_SetColor(GUI_RED);
			GUI_FillRect(3, 3, xPos, ySize - 4);
			GUI_SetAlpha(0);
			break;
		
		/* 使用内存设备绘制好要显示的内存 */
		case WM_CREATE:
			WM_SelectWindow(hWin);
			xSize = WM_GetWindowSizeX(hWin);
			ySize = WM_GetWindowSizeY(hWin);
			xPos  = WM_GetWindowOrgX(hWin);
			yPos  = WM_GetWindowOrgY(hWin);
		
		    /*  GUI_MEMDEV_NOTRANS
				创建存储设备，无透明性。用户必须确保正确绘制背景。
				这样可将存储设备用于非矩形区域。另一优势是速度较高：使
				用此标记可加速存储设备约30 - 50%。
			*/
			hBitmap = GUI_MEMDEV_CreateEx(xPos, yPos, xSize, ySize, GUI_MEMDEV_NOTRANS);
			if (hBitmap) 
			{
				hOld = GUI_MEMDEV_Select(hBitmap);
				GUI_DrawGradientV(3, 3, xSize - 4, ySize - 4, 0xEEEEEE, 0x737373);
				GUI_SetColor(GUI_BLACK);
				for (i = 1; i < 4; i++) 
				{
					GUI_DrawVLine(_aStatusSep[i], 0, 24);
				}
				GUI_SetColor(0xff0000);
				GUI_DrawRect(0, 0, xSize - 1, ySize - 1);
				GUI_DrawRect(1, 1, xSize - 2, ySize - 2);
				GUI_DrawRect(2, 2, xSize - 3, ySize - 3);
				GUI_SetTextMode(GUI_TM_TRANS);
				GUI_SetFont(&GUI_Font18);
				GUI_SetColor(GUI_WHITE);
				for (i = 0; i < 4; i++) 
				{
					GUI_DispStringHCenterAt(_pText[i], (_aStatusSep[i + 1] + _aStatusSep[i]) / 2, 3);
				}
				GUI_MEMDEV_Select(hOld);
			} 
			else 
			{
				_NoMemory = 1;
			}
			break;
			
		/* 窗口被删除后，记得删除申请的内存设备 */
		case WM_DELETE:
			GUI_MEMDEV_Delete(hBitmap);
			hBitmap = 0;
			break;
		
		default:
			WM_DefaultProc(pMsg);
	}
}

/*
*********************************************************************************************************
*	函 数 名: _cbMain
*	功能说明: 窗口hWinMain的回调函数  
*	形    参：pMsg  参数指针
*	返 回 值: 无
*********************************************************************************************************
*/
static void _cbMain(WM_MESSAGE * pMsg) 
{
	static GUI_MEMDEV_Handle hBitmap;
	unsigned                 i;
	WM_HWIN                  hWin;
	int                      xSizeStatus;
	int                      NCode;
	int                      Key;
	int                      Pos;

	hWin = pMsg->hWin;
	
	switch (pMsg->MsgId) 
	{
		/* 创建窗口上要显示的内容 */
		case WM_CREATE:
			hBitmap = _CreateBitmap(hWin, 10, 40, WM_GetWindowSizeX(hWin) - 10, 76);
			break;
		
		/* 按下状态已更改时，发送到指针输入设备指向的窗口 */
		case WM_PID_STATE_CHANGED:
			_OnPIDStateChangeMain(pMsg->hWin, (const WM_PID_STATE_CHANGED_INFO *)pMsg->Data.p);
			break;
		
		/* 外部按键消息的处理 */
		case WM_KEY:
			if (((const WM_KEY_INFO *)(pMsg->Data.p))->PressedCnt > 0) 
			{
				Key = ((const WM_KEY_INFO *)(pMsg->Data.p))->Key;
				_OnKeyMain(pMsg->hWin, Key);
			}
			break;
		
		/* 重绘函数 */
		case WM_PAINT:
			_OnPaintMain(pMsg->hWin, &hBitmap);
			break;
		
		/* 窗口被删除后，同时要删除内存设备和窗口_hStatus */
		case WM_DELETE:
			GUI_MEMDEV_Delete(hBitmap);
			hBitmap = 0;
			if (_hStatus) 
			{
				WM_DeleteWindow(_hStatus);
				_hStatus = 0;
			}
			/* 触发关闭子菜单 */
			_ToggleSubMenu(hWin, 0);
			break;
			
		case WM_NOTIFY_PARENT:
			NCode = pMsg->Data.v;
			switch (NCode) 
			{
				/* 点击start按钮释放后 */
				case WM_NOTIFICATION_RELEASED:
					WM_InvalidateWindow(hWin);
				
					/* 再次点击后进入到这个函数*/
					if (_State == STATE_WASHING) 
					{
						xSizeStatus = WM_GetWindowSizeX(_hStatus) - 6;
						for (i = 0; i < GUI_COUNTOF(_aStatusSep); i++) 
						{
							Pos = 3 + ((90 - _Time) * xSizeStatus) / 90;
							if (_aStatusSep[i] > Pos) 
							{
								_Time = 90 - ((_aStatusSep[i] - 3) * 90) / xSizeStatus;
								break;
							}
						}
					}
					
					/* 第一次点击后是进入到这个函数里面，并设置_State = STATE_WASHING */
					else 
					{
						WM_SendMessageNoPara(hWin, MAIN_CLOSE_SUB);
						_State = STATE_WASHING;
						/* 创建窗口_hStatus */
						if (_hStatus == 0) 
						{
							_hStatus = WM_CreateWindowAsChild(10, 20,120, 140, hWin, WM_CF_SHOW, _cbStatus, 0);
						}
					}
					break;
			}
			break;
		
        /* 打开菜单消息 */			
		case MAIN_OPEN_SUB:
			_ToggleSubMenu(hWin, 1);
			break;
		
		/* 关闭菜单消息 */		
		case MAIN_CLOSE_SUB:
			_ToggleSubMenu(hWin, 0);
			break;
		
		default:
			WM_DefaultProc(pMsg);
	}
}

/*
*********************************************************************************************************
*	函 数 名: _DrawBackground
*	功能说明: 桌面窗口的回调函数的WM_PAINT消息
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DrawBackground(void) 
{
	GUI_DrawGradientV(  0,  0, LCD_GetXSize(),  LCD_GetYSize(), 0xff0000, 0xff3131);
	GUI_SetColor(GUI_WHITE);
	GUI_FillRect(  5,  40, 100,  140);
	GUI_DrawGradientV(5, 80, 100, 140, 0xffffff, 0xffa0a0);

	GUI_UC_SetEncodeUTF8();
	GUI_SetFont(&GUI_FontYahei);
	GUI_SetTextMode(GUI_TM_TRANS);
	GUI_SetColor(GUI_WHITE);
	GUI_DispStringHCenterAt("aabb", 160, 5);
	GUI_UC_SetEncodeUTF8();
}

