guohanqing/stm32f407VG/components/Stemwin/emWinTask/MainTask.c
/*
*********************************************************************************************************
*	函 数 名: _cbBkWin
*	功能说明: 桌面窗口的回调函数
*	形    参：pMsg 指针参数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _cbBkWin(WM_MESSAGE * pMsg) 
{
	switch (pMsg->MsgId) 
	{
		case WM_PAINT:
			_DrawBackground();
			break;
		default:
			WM_DefaultProc(pMsg);
	}
}

/*
*********************************************************************************************************
*	函 数 名: _CreateButton
*	功能说明: 创建自定义按钮到内存设备中
*	形    参：hWin      窗口句柄
*             xPos      起始X轴位置
*             yPos      起始Y轴位置
*             xSize     长度
*             ySize     高度
*             Color0    绘制RoundBar的梯度色
*             Color1    绘制RoundBar的梯度色
*             Gradient0 梯度色
*             Gradient1 梯度色
*	返 回 值: hMem  内存设备创建后的句柄
*********************************************************************************************************
*/
static GUI_MEMDEV_Handle _CreateButton(WM_HWIN hWin, int xPos, int yPos, int xSize, int ySize, GUI_COLOR Color0, GUI_COLOR Color1, GUI_COLOR Gradient0, GUI_COLOR Gradient1) 
{
	GUI_MEMDEV_Handle hMem;
	GUI_MEMDEV_Handle hOld;
	int               xPosWin;
	int               yPosWin;
	int               r;

	r = xSize / 2;
	
	/* 首先要选择操作的窗口 */
	WM_SelectWindow(hWin);
	xPosWin = WM_GetWindowOrgX(hWin);
	yPosWin = WM_GetWindowOrgY(hWin);
	
	/* 创建内存设备 */
	hMem = GUI_MEMDEV_Create(xPosWin + xPos, yPosWin + yPos, xSize, ySize);
	
	/* 创建成功后，在内存设备上绘制按钮控件 */
	if (hMem) 
	{
		hOld = GUI_MEMDEV_Select(hMem);
		GUI_DrawGradientV(xPos, yPos, xPos + xSize, yPos + ySize, Gradient0, Gradient1);
		_DrawGradientRoundBar(xPos + 2, yPos + 2, xPos + xSize - 2, yPos + ySize - 2, Color0, Color1);
		GUI_SetColor(0xff0000);
		GUI_SetPenSize(3);
		GUI_AA_DrawArc(xPos + r, yPos + r, r - 2, r - 2, 0, 360);
		GUI_MEMDEV_Select(hOld);
	} 
	else 
	{
		_NoMemory = 1;
	}
	
	return hMem;
}

/*
*********************************************************************************************************
*	函 数 名: _cbButton
*	功能说明: 此函数主要用于得到按键的键值。
*	形    参：pMsg 指针参数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _cbButton(WM_MESSAGE * pMsg) 
{
	static GUI_MEMDEV_Handle   hButton00;
	static GUI_MEMDEV_Handle   hButton01;
	static GUI_MEMDEV_Handle   hButton10;
	static GUI_MEMDEV_Handle   hButton11;
	GUI_MEMDEV_Handle          hShow;
	WM_HWIN                    hWin;
	char                     * pText;
	int                        IsPressed;

	hWin = pMsg->hWin;
	switch (pMsg->MsgId) 
	{
		case WM_PAINT:
			/* 获取要显示的文本和按钮控件 */
		    GUI_SetColor(0xFFFFFF);
			GUI_SetFont(&GUI_Font18B);
			GUI_SetTextMode(GUI_TM_TRANS);
			IsPressed = BUTTON_IsPressed(hWin);
			hShow     = (_State == STATE_WASHING) ? (IsPressed ? hButton11 : hButton10) : (IsPressed ? hButton01 : hButton00);
			pText     = (_State == STATE_WASHING) ? "Skip" : "Start";
			
		    /* 要显示的按钮内容已经放到了内存设备中，这里直接调用下面的函数就能显示出来 */
		    GUI_MEMDEV_Write(hShow);
		    /* 显示文本 */
			GUI_DispStringHCenterAt(pText, 30, 21);
			break;
		
		case INIT_BUTTON:
			/* 创建四种按钮所需要的内存设备 */
			hButton00 = _CreateButton(hWin, 0, 0, 60, 60, 0x00aa00, 0xEEEEEE, 0xffe0e0, 0xffc0c0);
			hButton01 = _CreateButton(hWin, 0, 0, 60, 60, 0xEEEEEE, 0x00aa00, 0xffe0e0, 0xffc0c0);
			hButton10 = _CreateButton(hWin, 0, 0, 60, 60, 0x4040ff, 0xEEEEEE, 0xffe0e0, 0xffc0c0);
			hButton11 = _CreateButton(hWin, 0, 0, 60, 60, 0xEEEEEE, 0x4040ff, 0xffe0e0, 0xffc0c0);
			break;
		
		case WM_DELETE:
			/* 按钮被删除后，要删除前面申请的内存设备 */
			GUI_MEMDEV_Delete(hButton00);
			GUI_MEMDEV_Delete(hButton01);
			GUI_MEMDEV_Delete(hButton10);
			GUI_MEMDEV_Delete(hButton11);
			hButton00 = 0;
			hButton01 = 0;
			hButton10 = 0;
			hButton11 = 0;
			break;
		default:
			BUTTON_Callback(pMsg);
	}
}

/*
*********************************************************************************************************
*	函 数 名: _DemoWashingMachine
*	功能说明: 洗衣机演示程序，这个函数是可以被循环调用的，也就是说，这个函数不是死循环，如果按下了洗衣机
*             界面上的start按钮，执行完演示后就会退出这个函数，然后再重新的进入此函数。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DemoWashingMachine(void) 
{
	GUI_TIMER_TIME         TimeDiff;
	GUI_TIMER_TIME         TimeEnd;
	GUI_TIMER_TIME         TimeNow;
	WM_CALLBACK          * pcbPrev;
	WM_HWIN                hWinMain;
	WM_HWIN                hButton;

	/* 初始化相关变量 */
	(void) _NoMemory; /* 防止警告 */
	_NoMemory      = 0;
	_Time          = 90;
	_aSelection[0] = 1;
	_aSelection[1] = 0;
	_aSelection[2] = 1;
	_aSelection[3] = 1;
	_aSelection[4] = 0;
	_Selection     = 2;
	_State         = 0;
	
	/* 创建使用内存设备 */
	WM_SetCreateFlags(WM_CF_MEMDEV);
	/* 使能桌面窗口也使用内存设备 */
	WM_EnableMemdev(WM_HBKWIN);
	
	/* 设置桌面窗口的回调函数，并返回源桌面窗口的回调函数 */
	pcbPrev  = WM_SetCallback(WM_HBKWIN, _cbBkWin);
	
	/* 创建桌面窗口的子窗口，注意这里设置了透明标志 */
	hWinMain = WM_CreateWindowAsChild(5, 40, 128, 160, WM_HBKWIN, WM_CF_SHOW | WM_CF_HASTRANS, _cbMain, 0);
	/* 设置聚焦 */
	WM_SetFocus(hWinMain);
	
	/* 在窗口hWinMain上面创建按钮 */
	hButton = BUTTON_CreateEx(10, 90, 60, 60, hWinMain, WM_CF_SHOW, 0, GUI_ID_BUTTON0);
	/* 设置按钮的回调函数，本身按钮的回调函数是自动执行的，这里应该属于自定义回调函数 */
	WM_SetCallback(hButton, _cbButton);
	/* 发送消息，对按钮就行初始化 */
	WM_SendMessageNoPara(hButton, INIT_BUTTON);
	/* 设置聚焦 */
	WM_SetFocus(hButton);
	
	/* 如果创建了状态窗口_hStatus，在这里要将其删除，防止再次进入这个函数时重复的创建，从而造成
	   内存溢出。
	*/
	if (_hStatus) 
	{
		WM_DeleteWindow(_hStatus);
		WM_InvalidateWindow(hWinMain);
		_hStatus = 0;
	}
	
	while (1) 
	{
		/* 获取TimeNow和TimeEnd的数值*/
		TimeNow = GUI_GetTime();
		TimeEnd = TimeNow + 9000;
		
		/* 在9000ms的时间内做一个死循环 */
		while (TimeNow < TimeEnd) 
		{
			GUI_Delay(10);
			
			/* 如果在9000ms的时间内用户点击了start按钮，就开始动态更新相应界面 */
			if (_State == STATE_WASHING) 
			{
				TimeDiff = TimeEnd - TimeNow;
				_Time    = (TimeDiff * 90) / 9000;
				
				/* 如果界面窗口创建成功了，就进行更新 */
				if (_hStatus) 
				{
					WM_InvalidateWindow(hWinMain);
					WM_InvalidateWindow(_hStatus);
				}
			}		
			
			TimeNow = GUI_GetTime();
		}
		
		/* 演示完后删除按钮hButton，窗口hWinMain，并重还原为默认的桌面窗口回调函数 
		   然后退出本函数_DemoWashingMachine，再重新进入。
		*/
		if (_State == STATE_WASHING)
		{
			WM_SetCallback(WM_HBKWIN, pcbPrev);
			WM_DeleteWindow(hButton);
			WM_DeleteWindow(hWinMain);
			break;	
		}		
	}
}

/*
*********************************************************************************************************
*	函 数 名: MainTask
*	功能说明: GUI主函数
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void MainTask(void) 
{
	GUI_Init();
	
	while (flag_gui_timer) 
	{
		_DemoWashingMachine();
	}
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
